Autodesk.Navisworks.Api.Comment
A user comment. Immutable.

Autodesk.Navisworks.Api.Comment.#ctor(Autodesk.Navisworks.Api.Comment)
Create a comment from a copy of another comment
Throws System.ArgumentNullException:
Argument 'from' is null
Throws System.ArgumentException:
Argument 'from' has been Disposed

Autodesk.Navisworks.Api.Comment.#ctor(System.String,Autodesk.Navisworks.Api.CommentStatus)
Create a comment without a meaningfull id using current user as author. Use Document.CreateCommentWithUniqueId to create a comment with an unique id within a particular Document.

Autodesk.Navisworks.Api.Comment.#ctor(System.String,Autodesk.Navisworks.Api.CommentStatus,System.String)
Create a comment without a meaningfull id. Use Document.CreateCommentWithUniqueId to create a comment with an unique id within a particular Document.

Autodesk.Navisworks.Api.Comment.Author
Author (creator) of comment
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Comment.Body
Body of comment
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Comment.CreationDate
Date and time at which comment was created
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Comment.Equals(System.Object)
Determines whether the specified object and the current object refer to the same
underlying native object. Returns false if either object has been disposed.

Autodesk.Navisworks.Api.Comment.GetHashCode
Serves as a hash function for a particular type.  is suitable for use in hashing algorithms and data structures like a hash table.
Returns: A hash code for the current .

Autodesk.Navisworks.Api.Comment.Id
Comment identifier. Unique within a Document. 0 if no meaningful id.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Comment.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.Comment.Status
Status of comment
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.Comment.ToString
Returns a  that represents the current .
Returns: A  that represents the current .